Autodesk.Revit.UI.PreviewHwndHost.ScrollbarVisibility
The visibility of the preview view scrollbars.

Autodesk.Revit.UI.PreviewHwndHost.destroyHwndWindow
Destroy the window and release the modal scope and update the active view to NULL.

Autodesk.Revit.UI.PreviewHwndHost.BuildWindowCore(System.Runtime.InteropServices.HandleRef)
Creates the Hwnd of given db view as the child of hwndParent.

Autodesk.Revit.UI.PreviewHwndHost.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs the Preview host window to interop with win32 control.

Autodesk.Revit.UI.PreviewHwndHost
Hosts a Win32 window as an element within Windows Presentation Foundation (WPF) content.